In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [5]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [14]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [11]:
df.dropna(axis = 1)    #drops random row/col

   C
0  1
1  2
2  3

In [22]:
df.dropna(thresh=2) #min amout to na values ot drop.

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [25]:
df.fillna(value='Fi')  #Fill value in nan.

     A    B  C
0  1.0  5.0  1
1  2.0   Fi  2
2   Fi   Fi  3

In [26]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64